zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_pwr_ex.h
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_pwr_ex.h
  * @author  MCD Application Team
  * @brief   Header file of PWR HAL Extension module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP2xx_HAL_PWR_EX_H
#define __STM32MP2xx_HAL_PWR_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp2xx_hal_def.h"


/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @addtogroup PWREx
  * @{
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup PWREx_Exported_Types PWREx Exported Types
  * @{
  */

/**
  * @brief  PWREx voltage detector configuration structure definition
  */
typedef struct
{
  uint32_t Level;          /*!<   Level: Specifies the  detection level.
                                  This parameter can be a value of @ref PWREx  detection level */
  uint32_t Mode;           /*!<   Mode: Specifies the wake-up operating mode (see EXTI) for the selected pins
                                  This parameter can be a value of @ref PWR_EXTI_Mode */
} PWREx_DetectionTypeDef;
/**
  * @}
  */


/* Exported constants --------------------------------------------------------*/

/** @defgroup PWREx_Exported_Constants PWREx Exported Constants
  * @{
  */

/** @defgroup PWR_Exported_Constants_Group1 PWR_WakeUp_Pins
  * @{
  */

#if defined(CORE_CA35)
#define PWR_CPU_TO_WAKE_UP                   PWR_WKUPCR1_WKUPENCPU1
#endif /* CORE_CA35 */
#if defined(CORE_CM33)
#define PWR_CPU_TO_WAKE_UP                   PWR_WKUPCR1_WKUPENCPU2
#endif /* CORE_CM33 */

/*clear wake-up flag*/
#define PWR_WAKEUP_WKUPC                     PWR_WKUPCR1_WKUPC


/**
  * @}
  */


/** @defgroup PWR_Exported_Constants_Group3 PWREx Periph List
  * @{
  */
#define PWR_PVM_VDDIO1              0U
#define PWR_PVM_VDDIO2              1U
#define PWR_PVM_VDDIO3              2U
#define PWR_PVM_VDDIO4              3U
#define PWR_PVM_USB33               4U
#define PWR_PVM_UCPD                5U
#define PWR_PVM_A                   6U

#define PWR_PVM_MAX_PERIPH          7U


/**
  * @}
  */


/** @defgroup PWR_Exported_Constants_Group5 PWREx PVM Mode
  * @{
  */
#define PWR_PVM_MODE_NORMAL                              PWR_EXTI_MODE_NORMAL
#define PWR_PVM_MODE_IT_RISING                           PWR_EXTI_MODE_IT_RISING
#define PWR_PVM_MODE_IT_FALLING                          PWR_EXTI_MODE_IT_FALLING
#define PWR_PVM_MODE_IT_RISING_FALLING                   PWR_EXTI_MODE_IT_RISING_FALLING


/**
  * @}
  */

/** @defgroup PWR_Exported_Constants_Group6 PWREx VDDcpu detection level
  * @{
  */
#if defined (PWR_CR6_VCPUMONEN)
#define PWR_VDDCPUDLEVEL_0  (0U<<PWR_CR6_VCPULLS_Pos)
#define PWR_VDDCPUDLEVEL_1  (1U<<PWR_CR6_VCPULLS_Pos)
#endif /* PWR_CR6_VCPUMONEN */
/**
  * @}
  */

/** @defgroup PWR_Exported_Constants_Group7 PWREx VDDcpu/VDDcore Mode
  * @{
  */
#define PWREx_VBAT_TEMP_TAMPER_EVENT                         RTC_INT_TAMPER_2


#define PWR_VDDCPUD_MODE_NORMAL                              PWR_EXTI_MODE_NORMAL
#define PWR_VDDCPUD_MODE_IT_RISING                           PWR_EXTI_MODE_IT_RISING
#define PWR_VDDCPUD_MODE_IT_FALLING                          PWR_EXTI_MODE_IT_FALLING
#define PWR_VDDCPUD_MODE_IT_RISING_FALLING                   PWR_EXTI_MODE_IT_RISING_FALLING

#define PWR_VDDCORED_MODE_NORMAL                              PWR_EXTI_MODE_NORMAL
#define PWR_VDDCORED_MODE_IT_RISING                           PWR_EXTI_MODE_IT_RISING
#define PWR_VDDCORED_MODE_IT_FALLING                          PWR_EXTI_MODE_IT_FALLING
#define PWR_VDDCORED_MODE_IT_RISING_FALLING                   PWR_EXTI_MODE_IT_RISING_FALLING
/**
  * @}
  */


#ifdef CORE_CM33
/*both EXTI1 and EXTI2 interruptions are connected to M33 NVIC*/
#define EXTI_CONNECTOR1  EXTI1_C2
#define EXTI_CONNECTOR2  EXTI2_C2
#elif defined (CORE_CA35)
/*both EXTI1 and EXTI2 interruptions are connected to A35 GIC*/
#define EXTI_CONNECTOR1  EXTI1_C1
#define EXTI_CONNECTOR2  EXTI2_C1
#elif defined (CORE_CM0PLUS)
/*only  EXTI2 interruptions are connected to M0+ NVIC*/
#define EXTI_CONNECTOR2  EXTI2_C3
#endif /* CORE_CM33 */

/**
  * @brief  indicate voltage range where VDDGPU is
  * @retval None
  */
#define PWR_VDDGPU_BELOW_LOW_THRESHOLD                0U
#define PWR_VDDGPU_BELOW_HIGH_THRESHOLD               1U
#define PWR_VDDGPU_ABOVE_EQUAL_LOW_THRESHOLD          2U
#define PWR_VDDGPU_ABOVE_EQUAL_HIGH_THRESHOLD         3U
#define PWR_NO_VDDGPU_MEASUREMENT_AVAILABLE          15U

/**
  * @brief  indicate voltage range where VDDCPU is
  * @retval None
  */
#define PWR_VDDCPU_BETWEEN_HIGH_LOW_THRESHOLD  0U
#define PWR_VDDCPU_BELOW_LOW_THRESHOLD         1U
#define PWR_VDDCPU_ABOVE_HIGH_THRESHOLD        2U
#define PWR_NO_VDDCPU_MEASUREMENT_AVAILABLE    15U

/**
  * @brief  indicates voltage range where VDDCore is
  * @retval None
  */
#define PWR_VDDCORE_BETWEEN_HIGH_LOW_THRESHOLD  0U
#define PWR_VDDCORE_BELOW_LOW_THRESHOLD         1U
#define PWR_VDDCORE_ABOVE_HIGH_THRESHOLD        2U
#define PWR_NO_VDDCORE_MEASUREMENT_AVAILABLE    15U

/** @defgroup PWREx_Exported_Constants_Group7 PWREx VBAT Thresholds
  * @{
  */
#define PWR_VBAT_BETWEEN_HIGH_LOW_THRESHOLD  0U
#define PWR_VBAT_BELOW_LOW_THRESHOLD         1U  /*!< Vsw low threshold is ~1.35V */
#define PWR_VBAT_ABOVE_HIGH_THRESHOLD        2U  /*!< Vsw high threshold is ~3.6V */
#define PWR_NO_VBAT_MEASUREMENT_AVAILABLE    15U
/**
  * @}
  */

/** @defgroup PWR_Exported_Constants_Group8 PWREx Temperature Thresholds
  * @{
  */
#define PWR_TEMP_BETWEEN_HIGH_LOW_THRESHOLD  0U
#define PWR_TEMP_BELOW_LOW_THRESHOLD         1U
#define PWR_TEMP_ABOVE_HIGH_THRESHOLD        2U
#define PWR_NO_TEMP_MEASUREMENT_AVAILABLE    15U
/**
  * @}
  */

/** @defgroup PWR_Exported_Constants_Group9 PWREx Retention RAM supply state
  * @{
  */
#define PWR_RETENTION_RAM_SUPPLY_OFF             (0U << (uint32_t)PWR_CR10_RETRBSEN_Pos)  /*!< no Backup supply powering for retentionRAM*/
#define PWR_RETENTION_RAM_SUPPLY_ON_STDBY_VBAT   (1U << (uint32_t)PWR_CR10_RETRBSEN_Pos)  /*!< Backup supply powering for retentionRAM in both VBAT and STANDBY*/
#define PWR_RETENTION_RAM_SUPPLY_ON_STDBYONLY    (2U << (uint32_t)PWR_CR10_RETRBSEN_Pos)  /*!< Backup supply powering for retentionRAM in STANDBY only*/


#define IS_PWR_RETENTION_RAM_SUPPLY(__MODE__)          (((__MODE__) == PWR_RETENTION_RAM_SUPPLY_OFF) || \
                                                        ((__MODE__) == PWR_RETENTION_RAM_SUPPLY_ON_STDBY_VBAT)  || \
                                                        ((__MODE__) == PWR_RETENTION_RAM_SUPPLY_ON_STDBYONLY) )

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup PWREx_Exported_Macro PWREx Exported Macro
  *  @{
  */

/**
  * @brief Generic macros to manage EXTI event whatever instance of EXTI is and whatever connected CPU is
  * @param _LINE_: Specifies  on which EXTI line event is connected
  * @param INSTANCE: Specifies either EXTI instance or in case of interruption management macro,EXTI_connector instance
  * @retval None.
  */

#define __HAL_PWR_EXTI_ENABLE_IT(INSTANCE, _LINE_)   ((_LINE_ < 32U) ? SET_BIT(INSTANCE->IMR1, _LINE_)  :\
                                                      ((_LINE_ < 64U) ? SET_BIT(INSTANCE->IMR2, _LINE_) :\
                                                       SET_BIT(INSTANCE->IMR3, _LINE_)))

#define __HAL_PWR_EXTI_DISABLE_IT(INSTANCE, _LINE_)  ((_LINE_ < 32U) ? CLEAR_BIT(INSTANCE->IMR1, _LINE_)  :\
                                                      ((_LINE_ < 64U) ? CLEAR_BIT(INSTANCE->IMR2, _LINE_) :\
                                                       CLEAR_BIT(INSTANCE->IMR3, _LINE_)))

#define __HAL_PWR_EXTI_ENABLE_RISING_EDGE(INSTANCE, _LINE_)   ((_LINE_ < 32U) ? SET_BIT(INSTANCE->RTSR1, _LINE_)   :\
                                                               ((_LINE_ < 64U) ? SET_BIT(INSTANCE->RTSR2, _LINE_)  :\
                                                                SET_BIT(INSTANCE->RTSR3, _LINE_)))

