zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_pwr_ex.h
#define __HAL_PWR_EXTI_DISABLE_RISING_EDGE(INSTANCE, _LINE_)  ((_LINE_ < 32U) ? CLEAR_BIT(INSTANCE->RTSR1, _LINE_)  :\
                                                               ((_LINE_ < 64U) ? CLEAR_BIT(INSTANCE->RTSR2, _LINE_) :\
                                                                CLEAR_BIT(INSTANCE->RTSR3, _LINE_)))

#define __HAL_PWR_EXTI_ENABLE_FALLING_EDGE(INSTANCE, _LINE_)  ((_LINE_ < 32U) ? SET_BIT(INSTANCE->FTSR1, _LINE_)   :\
                                                               ((_LINE_ < 64U) ? SET_BIT(INSTANCE->FTSR2, _LINE_)  :\
                                                                SET_BIT(INSTANCE->FTSR3, _LINE_)))

#define __HAL_PWR_EXTI_DISABLE_FALLING_EDGE(INSTANCE, _LINE_)   ((_LINE_ < 32U) ? CLEAR_BIT(INSTANCE->FTSR1, _LINE_)  :\
                                                                 ((_LINE_ < 64U) ? CLEAR_BIT(INSTANCE->FTSR2, _LINE_) :\
                                                                  CLEAR_BIT(INSTANCE->FTSR3, _LINE_)))

#define __HAL_PWR_EXTI_GENERATE_SWIT(INSTANCE, _LINE_)  ((_LINE_ < 32U) ? SET_BIT(INSTANCE->SWIER1, _LINE_)  :\
                                                         ((_LINE_ < 64U) ? SET_BIT(INSTANCE->SWIER2, _LINE_) :\
                                                          SET_BIT(INSTANCE->SWIER3, _LINE_))

#define __HAL_PWR_EXTI_GET_FLAG(INSTANCE, _LINE_)     ((_LINE_ < 32U) ? (((INSTANCE->RPR1 & _LINE_) == _LINE_) || \
                                                                         (( INSTANCE->FPR1 & _LINE_) == _LINE_)) : \
                                                       ((_LINE_ < 64U) ? (((INSTANCE->RPR2 & _LINE_) == _LINE_) || \
                                                                          (( INSTANCE->FPR2 & _LINE_) == _LINE_)) : \
                                                        (((INSTANCE->RPR3 & _LINE_) == _LINE_) || \
                                                         (( INSTANCE->FPR3 & _LINE_) == _LINE_))))

#define __HAL_PWR_EXTI_CLEAR_RFLAG(INSTANCE, _LINE_)    ((_LINE_ < 32U) ? SET_BIT(INSTANCE->RPR1, _LINE_)  : \
                                                         ((_LINE_ < 64U) ? SET_BIT(INSTANCE->RPR2, _LINE_) : \
                                                          SET_BIT(INSTANCE->RPR3, _LINE_)))

#define __HAL_PWR_EXTI_CLEAR_FFLAG(INSTANCE, _LINE_)     ((_LINE_ < 32U) ? SET_BIT(INSTANCE->FPR1, _LINE_)  : \
                                                          ((_LINE_ < 64U) ? SET_BIT(INSTANCE->FPR2, _LINE_) : \
                                                           SET_BIT(INSTANCE->FPR3, _LINE_)))


#define __HAL_PWR_EXTI_CLEAR_FLAG(INSTANCE, _LINE_)           \
  do {\
    __HAL_PWR_EXTI_CLEAR_FFLAG(INSTANCE, _LINE_);  \
    __HAL_PWR_EXTI_CLEAR_RFLAG(INSTANCE, _LINE_);  \
  }while(0);

#define __HAL_PWR_EXTI_ENABLE_RISING_FALLING_EDGE(INSTANCE, _LINE_) \
  do { \
    __HAL_PWR_EXTI_ENABLE_RISING_EDGE(INSTANCE, _LINE_); \
    __HAL_PWR_EXTI_ENABLE_FALLING_EDGE(INSTANCE, _LINE_); \
  } while(0);

#define __HAL_PWR_EXTI_DISABLE_RISING_FALLING_EDGE(INSTANCE, _LINE_) \
  do { \
    __HAL_PWR_EXTI_DISABLE_RISING_EDGE(INSTANCE, _LINE_); \
    __HAL_PWR_EXTI_DISABLE_FALLING_EDGE(INSTANCE, _LINE_); \
  } while(0);


/**
  * @brief Enable the PVM  Exti Line.
  * @ note Exti Line is connected to Instance 1 of EXTI IP.
  * @note EXTI1 event are connected to A35_GIC and M33_NVIC but not to M0+_NVIC
  * @retval None.
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_PWR_PVM_EXTI_ENABLE_IT()  SET_BIT(EXTI_CONNECTOR1->IMR1, PWR_EXTI_LINE_PVM)
#endif /* CORE_CM0PLUS */

/**
  * @brief Disable the PVM  EXTI Line.
  * @ note Exti Line is connected to Instance 1 of EXTI IP.
  * @note EXTI1 event are connected to A35_GIC and M33_NVIC but not to M0+_NVIC
  * @retval None.
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_PWR_PVM_EXTI_DISABLE_IT() CLEAR_BIT(EXTI_CONNECTOR1->IMR1, PWR_EXTI_LINE_PVM)
#endif /* CORE_CM0PLUS */

/**
  * @brief Enable the PVM  Extended Interrupt Rising Trigger.
  * @retval None.
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_PWR_PVM_EXTI_ENABLE_RISING_EDGE()  SET_BIT(EXTI1->RTSR1, PWR_EXTI_LINE_PVM)
#endif /* CORE_CM0PLUS */

/**
  * @brief Disable the PVM  Extended Interrupt Rising Trigger.
  * @retval None.
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_PWR_PVM_EXTI_DISABLE_RISING_EDGE()  CLEAR_BIT(EXTI1->RTSR1, PWR_EXTI_LINE_PVM)
#endif /* CORE_CM0PLUS */


/**
  * @brief Enable the PVM Extended Interrupt Falling Trigger.
  * @retval None.
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_PWR_PVM_EXTI_ENABLE_FALLING_EDGE()  SET_BIT(EXTI1->FTSR1, PWR_EXTI_LINE_PVM)
#endif /* CORE_CM0PLUS */

/**
  * @brief Disable the PVM  Extended Interrupt Falling Trigger.
  * @retval None.
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_PWR_PVM_EXTI_DISABLE_FALLING_EDGE()  CLEAR_BIT(EXTI1->FTSR1, PWR_EXTI_LINE_PVM)
#endif /* CORE_CM0PLUS */

/**
  * @brief  PVM EXTI line configuration: set rising & falling edge trigger.
  * @retval None.
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_PWR_PVM_EXTI_ENABLE_RISING_FALLING_EDGE() \
  do { \
    __HAL_PWR_PVM_EXTI_ENABLE_RISING_EDGE(); \
    __HAL_PWR_PVM_EXTI_ENABLE_FALLING_EDGE(); \
  } while(0);
#endif /* CORE_CM0PLUS */


/**
  * @brief Disable the PVM Extended Interrupt Rising & Falling Trigger.
  * @retval None.
  */
#if !defined(CORE_CM0PLUS)
#define __HAL_PWR_PVM_EXTI_DISABLE_RISING_FALLING_EDGE() \
  do { \
    __HAL_PWR_PVM_EXTI_DISABLE_RISING_EDGE(); \
    __HAL_PWR_PVM_EXTI_DISABLE_FALLING_EDGE(); \
  } while(0);
#endif /* CORE_CM0PLUS */


/**
  * @brief Check whether the specified PVM EXTI interrupt flag is set or not.
  * @retval EXTI PVM Line Status.
  */
#define __HAL_PWR_PVM_EXTI_GET_FLAG() \
  (((EXTI1->RPR1 & PWR_EXTI_LINE_PVM) == PWR_EXTI_LINE_PVM) || \
   ((EXTI1->FPR1 & PWR_EXTI_LINE_PVM) == PWR_EXTI_LINE_PVM))


/**
  * @brief Clear the PVM Exti flag.
  * @retval None.
  */
#define __HAL_PWR_PVM_EXTI_CLEAR_FLAG() \
  do { \
    SET_BIT(EXTI1->RPR1, PWR_EXTI_LINE_PVM); \
    SET_BIT(EXTI1->FPR1, PWR_EXTI_LINE_PVM); \
  } while(0);


/**
  * @brief  Generates a Software interrupt on PVM EXTI line
  * @retval None
  */
/*PVM Event in Bank1 */
#define __HAL_PWR_PVM_EXTI_GENERATE_SWIT() SET_BIT(EXTI1->SWIER1, PWR_EXTI_LINE_PVM )


/**
  * @brief Enable/Disable  VDDgpuD  Extended interruption from EXTI1 to current CPU (VDDgpuD line connected to EXTI1)
  * @retval None.
  */
#define __HAL_PWR_VDDGPUD_EXTI_ENABLE_IT()  __HAL_PWR_EXTI_ENABLE_IT(EXTI_CONNECTOR1,PWR_EXTI_LINE_VDDGPUD)
#define __HAL_PWR_VDDGPUD_EXTI_DISABLE_IT()  __HAL_PWR_EXTI_DISABLE_IT(EXTI_CONNECTOR1,PWR_EXTI_LINE_VDDGPUD)


/**
  * @brief Enable/Disable the VDDgpuD  Extended Interrupt Rising Trigger from EXTI1 (VDDgpuD line connected to EXTI1)
  * @retval None.
  */
#define __HAL_PWR_VDDGPUD_EXTI_ENABLE_RISING_EDGE()  __HAL_PWR_EXTI_ENABLE_RISING_EDGE(EXTI1, PWR_EXTI_LINE_VDDGPUD)
#define __HAL_PWR_VDDGPUD_EXTI_DISABLE_RISING_EDGE()  __HAL_PWR_EXTI_DISABLE_RISING_EDGE(EXTI1, PWR_EXTI_LINE_VDDGPUD)

/**
  * @brief Enable/Disable the VDDgpuD  Extended Interrupt Falling Trigger from EXTI1 (VDDgpuD line connected to EXTI1)
  * @retval None.
  */
#define __HAL_PWR_VDDGPUD_EXTI_ENABLE_FALLING_EDGE()  __HAL_PWR_EXTI_ENABLE_FALLING_EDGE(EXTI1, PWR_EXTI_LINE_VDDGPUD)
#define __HAL_PWR_VDDGPUD_EXTI_DISABLE_FALLING_EDGE()  __HAL_PWR_EXTI_DISABLE_FALLING_EDGE(EXTI1, PWR_EXTI_LINE_VDDGPUD)

/**
  * @brief Enable/Disable the VDDgpuD  Extended Interrupt Falling and Rising Trigger from EXTI1
  *        (VDDgpuD line connected to EXTI1)
  * @retval None.
  */
#define __HAL_PWR_VDDGPUD_EXTI_ENABLE_RISING_FALLING_EDGE()  __HAL_PWR_EXTI_ENABLE_RISING_FALLING_EDGE(EXTI1, \
    PWR_EXTI_LINE_VDDGPUD)
#define __HAL_PWR_VDDGPUD_EXTI_DISABLE_RISING_FALLING_EDGE()  __HAL_PWR_EXTI_DISABLE_RISING_FALLING_EDGE(EXTI1, \
    PWR_EXTI_LINE_VDDGPUD)

/**
  * @brief Check whether the specified VDDgpuD EXTI interrupt flag is set or not from EXTI1
  *        (VDDgpuD line connected to EXTI1)
  * @retval EXTI VDDgpuD Line Status.
  */
#define __HAL_PWR_VDDGPUD_EXTI_GET_FLAG()  __HAL_PWR_EXTI_GET_FLAG(EXTI1, PWR_EXTI_LINE_VDDGPUD)

/**
  * @brief Clear the VDDgpuD Exti flag on EXTI1 (VDDgpuD line connected to EXTI1)
  * @retval None.
  */
#define __HAL_PWR_VDDGPUD_EXTI_CLEAR_FLAG()  __HAL_PWR_EXTI_CLEAR_FLAG(EXTI1, PWR_EXTI_LINE_VDDGPUD)

/**
  * @brief  Generates VDDgpuD Software interrupt  on EXTI1 (VDDgpuD line connected to EXTI1)
  * @retval None
  */
#define __HAL_PWR_VDDGPUD_EXTI_GENERATE_SWIT() __HAL_PWR_EXTI_GENERATE_SWIT(EXTI1, PWR_EXTI_LINE_VDDGPUD)


/**
  * @brief Enable/Disable  VDDcpuD  Extended interruption from EXTI2 to current CPU (VDDcpuD line connected to EXTI2)
  * @retval None.
  */
#define __HAL_PWR_VDDCPUD_EXTI_ENABLE_IT()  __HAL_PWR_EXTI_ENABLE_IT(EXTI_CONNECTOR2,PWR_EXTI_LINE_VDDCPUD)
#define __HAL_PWR_VDDCPUD_EXTI_DISABLE_IT()  (__HAL_PWR_EXTI_DISABLE_IT(EXTI_CONNECTOR2,PWR_EXTI_LINE_VDDCPUD))


/**
  * @brief Enable/Disable the VDDcpuD  Extended Interrupt Rising Trigger from EXTI2 (VDDcpuD line connected to EXTI2)
  * @retval None.
  */
#define __HAL_PWR_VDDCPUD_EXTI_ENABLE_RISING_EDGE()  __HAL_PWR_EXTI_ENABLE_RISING_EDGE(EXTI2, PWR_EXTI_LINE_VDDCPUD)
#define __HAL_PWR_VDDCPUD_EXTI_DISABLE_RISING_EDGE()  __HAL_PWR_EXTI_DISABLE_RISING_EDGE(EXTI2, PWR_EXTI_LINE_VDDCPUD)

/**
  * @brief Enable/Disable the VDDcpuD  Extended Interrupt Falling Trigger from EXTI2 (VDDcpuD line connected to EXTI2)
  * @retval None.
  */
#define __HAL_PWR_VDDCPUD_EXTI_ENABLE_FALLING_EDGE()  __HAL_PWR_EXTI_ENABLE_FALLING_EDGE(EXTI2, PWR_EXTI_LINE_VDDCPUD)
#define __HAL_PWR_VDDCPUD_EXTI_DISABLE_FALLING_EDGE()  __HAL_PWR_EXTI_DISABLE_FALLING_EDGE(EXTI2, PWR_EXTI_LINE_VDDCPUD)

/**
  * @brief Enable/Disable the VDDcpuD  Extended Interrupt Falling and Rising Trigger from EXTI2
  *        (VDDcpuD line connected to EXTI2)
  * @retval None.
  */
#define __HAL_PWR_VDDCPUD_EXTI_ENABLE_RISING_FALLING_EDGE()  __HAL_PWR_EXTI_ENABLE_RISING_FALLING_EDGE(EXTI2, \
    PWR_EXTI_LINE_VDDCPUD)
#define __HAL_PWR_VDDCPUD_EXTI_DISABLE_RISING_FALLING_EDGE()  __HAL_PWR_EXTI_DISABLE_RISING_FALLING_EDGE(EXTI2, \
    PWR_EXTI_LINE_VDDCPUD)

/**
  * @brief Check whether the specified VDDcpuD EXTI interrupt flag is set or not from EXTI2
  *        (VDDcpuD line connected to EXTI2)
  * @retval EXTI VDDcpuD Line Status.
  */
#define __HAL_PWR_VDDCPUD_EXTI_GET_FLAG()  __HAL_PWR_EXTI_GET_FLAG(EXTI2, PWR_EXTI_LINE_VDDCPUD)

/**
  * @brief Clear the VDDcpuD Exti flag on EXTI2 (VDDcpuD line connected to EXTI2)
  * @retval None.
  */
#define __HAL_PWR_VDDCPUD_EXTI_CLEAR_FLAG()  __HAL_PWR_EXTI_CLEAR_FLAG(EXTI2, PWR_EXTI_LINE_VDDCPUD)

/**
  * @brief  Generates VDDcpuD Software interrupt  on EXTI2 (VDDcpuD line connected to EXTI2)
  * @retval None
  */
#define __HAL_PWR_VDDCPUD_EXTI_GENERATE_SWIT() __HAL_PWR_EXTI_GENERATE_SWIT(EXTI2, PWR_EXTI_LINE_VDDCPUD)

/**
  * @brief Enable/Disable  VDDcoreD Extended interruption from EXTI2 to current CPU (VDDcoreD line connected to EXTI2)
  * @retval None.
  */
#define __HAL_PWR_VDDCORED_EXTI_ENABLE_IT()  __HAL_PWR_EXTI_ENABLE_IT(EXTI_CONNECTOR2,PWR_EXTI_LINE_VDDCORED)
#define __HAL_PWR_VDDCORED_EXTI_DISABLE_IT()  __HAL_PWR_EXTI_DISABLE_IT(EXTI_CONNECTOR2,PWR_EXTI_LINE_VDDCORED)


/**
  * @brief Enable/Disable the VDDcoreD  Extended Interrupt Rising Trigger on EXTI2 (VDDcoreD line connected to EXTI2)
  * @retval None.
  */
#define __HAL_PWR_VDDCORED_EXTI_ENABLE_RISING_EDGE()  __HAL_PWR_EXTI_ENABLE_RISING_EDGE(EXTI2, PWR_EXTI_LINE_VDDCORED)
#define __HAL_PWR_VDDCORED_EXTI_DISABLE_RISING_EDGE()  __HAL_PWR_EXTI_DISABLE_RISING_EDGE(EXTI2, PWR_EXTI_LINE_VDDCORED)

/**
  * @brief Enable/Disable the VDDcoreD  Extended Interrupt Falling Trigger on EXTI2 (VDDcoreD line connected to EXTI2)
  * @retval None.
  */
#define __HAL_PWR_VDDCORED_EXTI_ENABLE_FALLING_EDGE()   __HAL_PWR_EXTI_ENABLE_FALLING_EDGE(EXTI2, \
    PWR_EXTI_LINE_VDDCORED)
#define __HAL_PWR_VDDCORED_EXTI_DISABLE_FALLING_EDGE()  __HAL_PWR_EXTI_DISABLE_FALLING_EDGE(EXTI2, \
    PWR_EXTI_LINE_VDDCORED)

/**
  * @brief Enable/Disable the VDDcoreD  Extended Interrupt Falling and Rising Trigger on EXTI2
  *        (VDDcoreD line connected to EXTI2)
  * @retval None.
  */
#define __HAL_PWR_VDDCORED_EXTI_ENABLE_RISING_FALLING_EDGE()   __HAL_PWR_EXTI_ENABLE_RISING_FALLING_EDGE(EXTI2, \
    PWR_EXTI_LINE_VDDCORED)
#define __HAL_PWR_VDDCORED_EXTI_DISABLE_RISING_FALLING_EDGE()  __HAL_PWR_EXTI_DISABLE_RISING_FALLING_EDGE(EXTI2, \
    PWR_EXTI_LINE_VDDCORED)

/**
  * @brief Check whether the specified VDDcoreD EXTI interrupt flag is set or not on EXTI2
  *        (VDDcoreD line connected to EXTI2)
  * @retval EXTI VDDcoreD Line Status.
  */
#define __HAL_PWR_VDDCORED_EXTI_GET_FLAG()  __HAL_PWR_EXTI_GET_FLAG(EXTI2, PWR_EXTI_LINE_VDDCORED)

/**
  * @brief Clear the VDDcoreD Exti flag on EXTI2 (VDDcoreD line connected to EXTI2)
  * @retval None.
  */
#define __HAL_PWR_VDDCORED_EXTI_CLEAR_FLAG()  __HAL_PWR_EXTI_CLEAR_FLAG(EXTI2, PWR_EXTI_LINE_VDDCORED)

/**
  * @brief  Generates VDDcoreD Software interrupt  on EXTI2 (VDDcoreD line connected to EXTI2)
  * @retval None
  */
#define __HAL_PWR_VDDCORED_EXTI_GENERATE_SWIT() __HAL_PWR_EXTI_GENERATE_SWIT(EXTI2, PWR_EXTI_LINE_VDDCORED)


/**
  * @brief Enable/Disable  NS TAMPER Extended interruption from EXTI2 to current CPU (TAMPER line connected to EXTI2)
  * @retval None.
  */
#define __HAL_PWR_NS_TAMPER_EXTI_ENABLE_IT()   __HAL_PWR_EXTI_ENABLE_IT (EXTI_CONNECTOR2,PWR_EXTI_LINE_NS_TAMPER)
#define __HAL_PWR_NS_TAMPER_EXTI_DISABLE_IT()  __HAL_PWR_EXTI_DISABLE_IT(EXTI_CONNECTOR2,PWR_EXTI_LINE_NS_TAMPER)

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup PWREx_Exported_Functions PWREx Exported Functions
  * @{
  */

/** @defgroup PWREx_Exported_Functions_Group1 Low power control functions
  * @{
  */
/* Power Wakeup PIN IRQ Handler */
#if !defined(CORE_CM0PLUS)
void HAL_PWREx_WAKEUP_PIN_IRQHandler(void);
#endif /* CORE_CM0PLUS */

/**
  * @}
  */

