zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_hal_pwr_ex.h
/** @defgroup PWREx_Exported_Functions_Group2 Peripherals control functions
  * @{
  */
/* Backup regulator control functions for backupRAM*/
void HAL_PWREx_EnableBkUpRamContentStandbyRetention(void);
void HAL_PWREx_DisableBkUpRamContentStandbyRetention(void);

/* Backup regulator control functions  for retentionRAM*/
void HAL_PWREx_EnableRetRamContentStandbyRetention(uint32_t RetentionRamPowerSupplyMode);
void HAL_PWREx_DisableRetRamContentStandbyRetention(void);

#if defined(PWR_CR9_LPR1BSEN)
/* Backup regulator control functions for CPU3 LPSRAM */
void HAL_PWREx_EnableLpsram1ContentStandby2Retention(void);
void HAL_PWREx_DisableLpsram1ContentStandby2Retention(void);
#endif /* defined(PWR_CR9_LPR1BSEN) */

/**
  * @}
  */

/** @defgroup PWREx_Exported_Functions_Group3 Power Monitoring functions
  * @{
  */
/* Power VBAT/Temperature monitoring functions */
#if defined(CORE_CM33)||defined(CORE_CA35)
void HAL_PWREx_EnableVbatTempMonitoring(void);
void HAL_PWREx_DisableVbatTempMonitoring(void);
#endif /* defined(CORE_CM33)||defined(CORE_CA35)) */
uint32_t HAL_PWREx_GetTemperatureLevel(void);
uint32_t HAL_PWREx_GetVbatLevel(void);
void HAL_PWREx_TEMP_VBAT_IRQHandler(void);
void HAL_PWREx_TEMP_HIGHERCallback(void);
void HAL_PWREx_TEMP_LowerCallback(void);
void HAL_PWREx_TEMP_INRANGECallback(void);
void HAL_PWREx_VBAT_HIGHERCallback(void);
void HAL_PWREx_VBAT_LowerCallback(void);
void HAL_PWREx_VBAT_INRANGECallback(void);

#if defined(PWR_CR12_VDDGPURDY)
/* GPU supply functions */
#if defined(CORE_CM33)||defined(CORE_CA35)
HAL_StatusTypeDef HAL_PWREx_EnableGPUSupply(void);
void HAL_PWREx_DisableGPUSupply(void);
HAL_StatusTypeDef HAL_PWREx_EnableGPUSupplyMonitoring(void);
void HAL_PWREx_DisableGPUSupplyMonitoring(void);
HAL_StatusTypeDef HAL_PWREx_EnableGPULowThreshold(void);
void HAL_PWREx_DisableGPULowThreshold(void);
uint32_t HAL_PWREx_GetVDDgpuRange(void);
void HAL_PWREx_GPU_IRQHandler(void);
void HAL_PWREx_GPU_EqualHigherCallback(void);
void HAL_PWREx_GPU_LowerCallback(void);
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */
#endif /* defined(PWR_CR12_VDDGPURDY) */

/* Power PVM configuration functions */
#if defined(CORE_CM33)||defined(CORE_CA35)
void HAL_PWREx_Set_IO_Voltage(uint32_t periph, uint32_t setLow, uint32_t setLowStandby);
void HAL_PWREx_Get_IO_Voltage(uint32_t periph, uint32_t *isLow, uint32_t *isLowStandby);
void HAL_PWREx_ConfigurePVM(uint32_t mode);
HAL_StatusTypeDef HAL_PWREx_EnableSupply(uint32_t periph);
void HAL_PWREx_DisableSupply(uint32_t periph);
void HAL_PWREx_EnableSupplyMonitoring(uint32_t periph);
void HAL_PWREx_DisableSupplyMonitoring(uint32_t periph);
uint32_t HAL_PWREx_PVM_IsBelowThreshold(uint32_t periph);
void HAL_PWREx_PVM_IRQHandler(void);
void HAL_PWREx_PVM_EqualHigherCallback(void);
void HAL_PWREx_PVM_LowerCallback(void);
#endif /*defined(CORE_CM33)||defined(CORE_CA35)*/

#if defined (PWR_CR6_VCPUMONEN)
/* Power VDDcpu detection functions */
#if defined(CORE_CM33)||defined(CORE_CA35)
void HAL_PWREx_ConfigVDDcpuD(const PWREx_DetectionTypeDef *sConfigVDDcpuD);
void HAL_PWREx_EnableVDDcpuD(void);
void HAL_PWREx_DisableVDDcpuD(void);
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */
uint32_t HAL_PWREx_GetVDDcpuRange(void);
void HAL_PWREx_VDDcpuD_IRQHandler(void);
void HAL_PWREx_VDDcpuD_HIGHERCallback(void);
void HAL_PWREx_VDDcpuD_LowerCallback(void);
void HAL_PWREx_VDDcpuD_INRANGECallback(void);
#endif /* PWR_CR6_VCPUMONEN */

#if defined (PWR_CR5_VCOREMONEN)
/* Power VDDcore detection functions */
#if defined(CORE_CM33)||defined(CORE_CA35)
void HAL_PWREx_ConfigVDDcoreD(const PWREx_DetectionTypeDef *sConfigVDDcoreD);
void HAL_PWREx_EnableVDDcoreD(void);
void HAL_PWREx_DisableVDDcoreD(void);
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */
uint32_t HAL_PWREx_GetVDDcoreRange(void);
void HAL_PWREx_VDDcoreD_IRQHandler(void);
void HAL_PWREx_VDDcoreD_HIGHERCallback(void);
void HAL_PWREx_VDDcoreD_LowerCallback(void);
void HAL_PWREx_VDDcoreD_INRANGECallback(void);
#endif /* PWR_CR5_VCOREMONEN */

/*new API for system pwr state (STM32MP2 specific)*/
void HAL_PWREx_EnterCSTOPAllowSTOP(uint32_t Regulator, uint8_t STOPEntry);
#if defined(CORE_CM33)||defined(CORE_CA35)
void HAL_PWREx_EnterCSTOPAllowSTANDBY(uint8_t  STANDBYType);
#endif /* defined(CORE_CM33)||defined(CORE_CA35) */

void HAL_PWREx_ClearStatusFlag(void);

#if defined(CORE_CM33)||defined(CORE_CA35)
void HAL_PWREx_WKUP_Callback(__attribute__((unused))uint16_t line);
#endif /*defined(CORE_CM33)||defined(CORE_CA35)*/
/**
  * @}
  */

/**
  * @}
  */


/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/** @defgroup PWREx_Private_Macros PWREx Private Macros
  * @{
  */

/** @defgroup PWREx_IS_PWR_Definitions PWREx Private macros to check input parameters
  * @{
  */

#define IS_PWR_CONFIGURABLE_IO(__PERIPH__)         (((__PERIPH__)==(PWR_PVM_VDDIO1))||((__PERIPH__)==(PWR_PVM_VDDIO2)))


#define IS_PWR_PVM_PERIPH(__PERIPH__)         ((__PERIPH__)<(PWR_PVM_MAX_PERIPH))

#define IS_PWR_PVM_MODE(MODE) IS_PWR_EXTI_MODE(MODE)
#define IS_AN_INTERRUPT_PWR_PVM_MODE(MODE)  IS_AN_INTERRUPT_PWR_EXTI_MODE(MODE)

#if defined (PWR_CR6_VCPUMONEN)
#define IS_PWR_VDDCPUD_LEVEL(LEVEL)  (((LEVEL) == PWR_VDDCPUDLEVEL_0) || ((LEVEL) == PWR_VDDCPUDLEVEL_1))
#endif /* PWR_CR6_VCPUMONEN */
#define IS_PWR_VDDCPUD_MODE(MODE) IS_PWR_EXTI_MODE(MODE)
#define IS_AN_INTERRUPT_PWR_VDDCPUD_MODE(MODE)  IS_AN_INTERRUPT_PWR_EXTI_MODE(MODE)


#define IS_PWR_VDDCORED_MODE(MODE) IS_PWR_EXTI_MODE(MODE)
#define IS_AN_INTERRUPT_PWR_VDDCORED_MODE(MODE)  IS_AN_INTERRUPT_PWR_EXTI_MODE(MODE)
/**
  * @}
  */

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif


#endif /* __STM32MP2xx_HAL_PWR_EX_H */
